spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/with_valid_card/creates_a_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=3&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_OJz03Gsmewauak1Y2dSEuUtJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        Hagios-MacBook-Pro.local 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1 17:57:12
        PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 18 Aug 2013 14:02:09 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '550'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"tok_2PLR24jUekC2cq\",\n  \"livemode\": false,\n  \"created\":
        1376834527,\n  \"used\": false,\n  \"object\": \"token\",\n  \"type\": \"card\",\n
        \ \"card\": {\n    \"id\": \"card_2PLRajiLpzRiLL\",\n    \"object\": \"card\",\n
        \   \"last4\": \"4242\",\n    \"type\": \"Visa\",\n    \"exp_month\": 3,\n
        \   \"exp_year\": 2016,\n    \"fingerprint\": \"dYM8NQQzCkhwHw6j\",\n    \"customer\":
        null,\n    \"country\": \"US\",\n    \"name\": null,\n    \"address_line1\":
        null,\n    \"address_line2\": null,\n    \"address_city\": null,\n    \"address_state\":
        null,\n    \"address_zip\": null,\n    \"address_country\": null\n  }\n}\n"
    http_version: 
  recorded_at: Sun, 18 Aug 2013 14:02:09 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_2PLR24jUekC2cq&email=veronica.marks%40brown.biz&plan=premium
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.3
      Authorization:
      - Bearer sk_test_OJz03Gsmewauak1Y2dSEuUtJ
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.3","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.3.0","publisher":"stripe","uname":"Darwin
        Hagios-MacBook-Pro.local 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1 17:57:12
        PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '69'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 18 Aug 2013 14:02:12 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2154'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
    body:
      encoding: US-ASCII
      string: ! "{\n  \"object\": \"customer\",\n  \"created\": 1376834531,\n  \"id\":
        \"cus_2PLRc63LMKxGVM\",\n  \"livemode\": false,\n  \"description\": null,\n
        \ \"email\": \"veronica.marks@brown.biz\",\n  \"delinquent\": false,\n  \"subscription\":
        {\n    \"plan\": {\n      \"interval\": \"month\",\n      \"name\": \"Myflix
        monthly plan\",\n      \"amount\": 999,\n      \"currency\": \"cad\",\n      \"id\":
        \"premium\",\n      \"object\": \"plan\",\n      \"livemode\": false,\n      \"interval_count\":
        1,\n      \"trial_period_days\": null\n    },\n    \"object\": \"subscription\",\n
        \   \"start\": 1376834531,\n    \"status\": \"active\",\n    \"customer\":
        \"cus_2PLRc63LMKxGVM\",\n    \"cancel_at_period_end\": false,\n    \"current_period_start\":
        1376834531,\n    \"current_period_end\": 1379512931,\n    \"ended_at\": null,\n
        \   \"trial_start\": null,\n    \"trial_end\": null,\n    \"canceled_at\":
        null,\n    \"quantity\": 1\n  },\n  \"discount\": null,\n  \"account_balance\":
        0,\n  \"cards\": {\n    \"object\": \"list\",\n    \"count\": 1,\n    \"url\":
        \"/v1/customers/cus_2PLRc63LMKxGVM/cards\",\n    \"data\": [\n      {\n        \"id\":
        \"card_2PLRajiLpzRiLL\",\n        \"object\": \"card\",\n        \"last4\":
        \"4242\",\n        \"type\": \"Visa\",\n        \"exp_month\": 3,\n        \"exp_year\":
        2016,\n        \"fingerprint\": \"dYM8NQQzCkhwHw6j\",\n        \"customer\":
        \"cus_2PLRc63LMKxGVM\",\n        \"country\": \"US\",\n        \"name\": null,\n
        \       \"address_line1\": null,\n        \"address_line2\": null,\n        \"address_city\":
        null,\n        \"address_state\": null,\n        \"address_zip\": null,\n
        \       \"address_country\": null,\n        \"cvc_check\": \"pass\",\n        \"address_line1_check\":
        null,\n        \"address_zip_check\": null\n      }\n    ]\n  },\n  \"default_card\":
        \"card_2PLRajiLpzRiLL\",\n  \"active_card\": {\n    \"id\": \"card_2PLRajiLpzRiLL\",\n
        \   \"object\": \"card\",\n    \"last4\": \"4242\",\n    \"type\": \"Visa\",\n
        \   \"exp_month\": 3,\n    \"exp_year\": 2016,\n    \"fingerprint\": \"dYM8NQQzCkhwHw6j\",\n
        \   \"customer\": \"cus_2PLRc63LMKxGVM\",\n    \"country\": \"US\",\n    \"name\":
        null,\n    \"address_line1\": null,\n    \"address_line2\": null,\n    \"address_city\":
        null,\n    \"address_state\": null,\n    \"address_zip\": null,\n    \"address_country\":
        null,\n    \"cvc_check\": \"pass\",\n    \"address_line1_check\": null,\n
        \   \"address_zip_check\": null\n  }\n}\n"
    http_version: 
  recorded_at: Sun, 18 Aug 2013 14:02:12 GMT
recorded_with: VCR 2.5.0
